# 문제1

In [2]:
import pandas as pd

df = pd.read_csv('members.csv')
df.head()

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2021-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2021-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2021-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2021-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2021-03-07  1338.0

In [25]:
median_value = df['f1'].median()
print(median_value)

df['f1'] = df['f1'].fillna(median_value)

df.isna().sum()

63.0

id             0
age            0
city           0
f1             0
f2             0
f3            28
f4             0
f5             0
subscribed     0
views          4
dtype: int64

In [26]:
print(df.shape)
df = df.dropna()
print(df.shape)

(100, 10)
(72, 10)

In [35]:
df_70 = df[:int(len(df) * 0.7)]

In [36]:
df_q3 = df_70['views'].quantile(.75)
df_q1 = df_70['views'].quantile(.25)

print(df_q3-df_q1)

3261.0

# 문제2

In [5]:
df = pd.read_csv('members.csv')
df.head()

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2021-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2021-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2021-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2021-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2021-03-07  1338.0

In [12]:
print(df.isna().sum())

len(df) * 0.3
# f1 삭제 
# f3 최빈값

print(df.shape)
df = df.dropna(subset = ['f1'])
print(df.shape)

id             0
age            0
city           0
f1            31
f2             0
f3            28
f4             0
f5             0
subscribed     0
views          4
dtype: int64
(100, 10)
(69, 10)

In [ ]:
mode_value = df['f3'].mode()[0]
print(mode_value)

print(df.isna().sum())
df['f3'] = df['f3'].fillna(mode_value)
print(df.isna().sum())

print(len(df['f3'] == 'gold')) # 이렇게 하는 것 주의 : 이러면 gold인 것만 세는게 아니라 전체 갯수를 셈(False도 표현됨)

print(len(df[df['f3'] == 'gold']))

cond = df['f3'] == 'gold'
print(len(df[cond]))

print(sum(df['f3'] == 'gold'))

gold
id            0
age           0
city          0
f1            0
f2            0
f3            0
f4            0
f5            0
subscribed    0
views         2
dtype: int64
id            0
age           0
city          0
f1            0
f2            0
f3            0
f4            0
f5            0
subscribed    0
views         2
dtype: int64
56
69
56
56

# 문제3

In [31]:
df = pd.read_csv('members.csv')
df.head()

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2021-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2021-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2021-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2021-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2021-03-07  1338.0

In [32]:
print(df.shape)
df = df.dropna(subset = ['views'])
print(df.shape)

(100, 10)
(96, 10)

In [46]:
# 1) replace

import numpy as np

print(df.head(8))
df['f3'] = df['f3'].replace(np.nan, 0).replace('silver', 1).replace('gold', 2).replace('vip', 3)
print(df.head(8))

     id   age city     f1  f2  f3    f4         f5  subscribed    views
0  id01   2.0   서울    NaN   0   2  ENFJ  91.297791  2021-07-16   6820.0
1  id02   9.0   서울   70.0   1   0  ENFJ  60.339826  2021-05-12   2534.0
2  id03  27.0   서울   61.0   1   2  ISTJ  17.252986  2021-03-16   7312.0
3  id04  75.0   서울    NaN   2   0  INFP  52.667078  2021-07-21    493.0
4  id05  24.0   서울   85.0   2   0  ISFJ  29.269869  2021-03-07   1338.0
5  id06  22.0   서울   57.0   0   3  INTP  20.129444  2021-09-12  21550.0
6  id07  36.3   서울   60.0   1   0  ISFJ   9.796378  2021-01-11     61.0
7  id08  38.0   서울  101.0   1   1  INFJ  83.685380  2021-03-06   3260.0
     id   age city     f1  f2  f3    f4         f5  subscribed    views
0  id01   2.0   서울    NaN   0   2  ENFJ  91.297791  2021-07-16   6820.0
1  id02   9.0   서울   70.0   1   0  ENFJ  60.339826  2021-05-12   2534.0
2  id03  27.0   서울   61.0   1   2  ISTJ  17.252986  2021-03-16   7312.0
3  id04  75.0   서울    NaN   2   0  INFP  52.667078  2021-07-21    493.0
4  id05  24.0   서울   85.0   2   0  ISFJ  29.269869  2021-03-07   1338.0
5  id06  22.0   서울   57.0   0   3  INTP  20.129444  2021-09-12  21550.0
6  id07  36.3   서울   60.0   1   0  ISFJ   9.796378  2021-01-11     61.0
7  id08  38.0   서울  101.0   1   1  INFJ  83.685380  2021-03-06   3260.0

In [47]:
print(df['f3'].sum())

133

In [50]:
# 2) map
df = pd.read_csv('members.csv')

dict_list = {np.nan: 0, 'silver': 1, 'gold': 2, 'vip': 3}
df['f3'] = df['f3'].map(dict_list)
print(df['f3'].sum())

133

In [52]:
# 3) condition

df = pd.read_csv('members.csv')

r1 = sum(df['f3'] == 'silver') * 1
r2 = sum(df['f3'] == 'gold') * 2
r3 = sum(df['f3'] == 'vip') * 3

print(r1 + r2 + r3)

133

# 문제4

In [57]:
df = pd.read_csv('members.csv')
df.head()

# cols = df.select_dtypes(include='object').columns
# df = df.drop(cols, axis=1)
# df.head()

cols = df.select_dtypes(exclude='object').columns
df = df[cols]
df.head()

    age    f1  f2         f5   views
0   2.0   NaN   0  91.297791  6820.0
1   9.0  70.0   1  60.339826  2534.0
2  27.0  61.0   1  17.252986  7312.0
3  75.0   NaN   2  52.667078   493.0
4  24.0  85.0   2  29.269869  1338.0

In [59]:
df = df.fillna(0)
df.head()

    age    f1  f2         f5   views
0   2.0   0.0   0  91.297791  6820.0
1   9.0  70.0   1  60.339826  2534.0
2  27.0  61.0   1  17.252986  7312.0
3  75.0   0.0   2  52.667078   493.0
4  24.0  85.0   2  29.269869  1338.0

In [60]:
df = df.T
df.head()

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
age,2.000000,9.000000,27.000000,75.000000,24.000000,22.000000,36.300000,38.00000,3.300000,95.000000,...,54.000000,6.000000,97.000000,21.800000,84.000000,77.000000,92.000000,100.000000,39.000000,1.000000
f1,0.000000,70.000000,61.000000,0.000000,85.000000,57.000000,60.000000,101.00000,35.000000,74.000000,...,0.000000,72.000000,78.000000,57.000000,0.000000,43.000000,53.000000,0.000000,58.000000,47.000000
f2,0.000000,1.000000,1.000000,2.000000,2.000000,0.000000,1.000000,1.00000,2.000000,1.000000,...,0.000000,0.000000,1.000000,0.000000,1.000000,1.000000,1.000000,0.000000,2.000000,0.000000
f5,91.297791,60.339826,17.252986,52.667078,29.269869,20.129444,9.796378,83.68538,17.252986,98.429899,...,29.269869,9.796378,97.381034,73.586397,90.496999,91.297791,52.667078,67.886373,98.429899,97.381034
views,6820.000000,2534.000000,7312.000000,493.000000,1338.000000,21550.000000,61.000000,3260.00000,2764.000000,9992.000000,...,3818.000000,8988.000000,9625.000000,42.000000,3774.000000,8697.000000,4336.000000,6687.000000,865.000000,6090.000000

In [64]:
print(sum(df.sum() > 3000))

73

# 문제5

In [65]:
df = pd.read_csv('members.csv')
df.head()

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2021-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2021-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2021-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2021-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2021-03-07  1338.0

In [72]:
q3 = df['views'].quantile(.75)
q1 = df['views'].quantile(.25)
print(q3)
print(q1)

IQR = q3 - q1
print(IQR)

low_line = q1 - 1.5 * IQR
high_line = q3 + 1.5 * IQR

print(sum(df['views'] < low_line))
print(sum(df['views'] > high_line))

print(sum(df['views'] < low_line) + sum(df['views'] > high_line))

8144.5
3031.0
5113.5
0
4
4

# 문제6

In [86]:
df = pd.read_csv('members.csv')
df.head()

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2021-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2021-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2021-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2021-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2021-03-07  1338.0

In [87]:
r1 = df['views'].std()
r1

np.float64(4170.860768106485)

In [88]:
cond = df['age'] <= 0
print(df.shape)
df = df[~cond]
print(df.shape)

(100, 10)
(96, 10)

In [89]:
cond = df['age'] == round(df['age'], 0)
print(df.shape)
df = df[cond]
print(df.shape)

(96, 10)
(90, 10)

In [90]:
r2 = df['views'].std()
r2

np.float64(4249.83323306832)

In [92]:
print(round(r1 + r2, 2))

8420.69

# 문제 7

In [93]:
import pandas as pd
import random
random.seed(2022)
df = pd.DataFrame()
for i in range(0, 5):
    list_box = []
    for k in range(0, 200):
        ran_num = random.randint(1,200)
        list_box.append(ran_num)
    df[i+2000] = list_box
df = df.T
df.to_csv("data.csv", index=True)

In [94]:
df = pd.read_csv("data.csv", index_col="Unnamed: 0")
df.head()

,0,1,2,3,4,5,6,7,8,9,...,190,191,192,193,194,195,196,197,198,199
2000,137,74,114,140,80,150,16,133,178,181,...,124,94,118,12,50,191,137,174,56,128
2001,176,87,64,110,128,16,8,4,123,87,...,59,22,3,108,17,104,101,161,156,43
2002,128,132,123,112,134,160,180,47,115,155,...,160,111,116,75,48,51,81,101,194,73
2003,78,45,26,50,177,119,47,72,163,125,...,163,88,52,79,192,83,5,75,196,119
2004,1,162,124,12,1,126,58,123,186,161,...,100,93,86,12,115,72,29,30,88,150

In [101]:
mean_2001 = df.loc[2001].mean()
cond = df.loc[2001] > mean_2001
num_2001 = sum(cond)

In [99]:
mean_2003 = df.loc[2003].mean()
cond = df.loc[2003] < mean_2003
num_2003 = sum(cond)

In [102]:
print(num_2001 + num_2003)

202

# 문제 8

In [ ]:
df = pd.read_csv('members.csv')
df.isnull().sum()

id             0
age            0
city           0
f1            31
f2             0
f3            28
f4             0
f5             0
subscribed     0
views          4
dtype: int64

In [106]:
df = df.fillna(method='bfill')
df.isnull().sum()

/var/folders/nl/dky9tsyn227718ljm_s34x600000gn/T/ipykernel_33709/3303654513.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df = df.fillna(method='bfill')

id            0
age           0
city          0
f1            0
f2            0
f3            0
f4            0
f5            0
subscribed    0
views         0
dtype: int64

In [111]:
df = df.groupby(['city', 'f2']).sum().reset_index()
df

,city,f2,id,age,f1,f3,f4,f5,subscribed,views
0,경기,0,id100id60id62id65id69id72id74id75id76id77id79i...,1088.9,1348.0,vipgoldsilversilversilvergoldgoldgoldgoldgoldg...,ESFPESFPINTPISFPESTJESTJESTPESTPENTJINFPINTJIS...,1391.927648,2021-02-212021-11-242021-04-102021-01-102021-1...,125142.0
1,경기,1,id63id66id67id70id73id78id81id83id87id89id92id...,976.0,938.0,silvergoldgoldsilvergoldgoldvipvipgoldgoldgold...,ISFJISFPISFJISTPISFJINTJISFJENTPISFPENTJINFPES...,935.958628,2021-12-012021-08-052021-06-172021-11-172021-0...,84652.0
2,경기,2,id61id64id68id71id98,239.0,311.0,silvergoldgoldgoldgold,INTPESFPISFPISFPINFP,362.300060,2021-02-032021-02-222021-07-292021-07-152021-1...,23764.0
3,대구,0,id40id41id43id44id45id46id48id49id51id53id57,578.0,860.0,goldgoldsilvergoldgoldgoldgoldgoldgoldgoldsilver,ENFPENFJISTPINTPENFJESTJENFPINTPISTJESTPISFJ,371.184620,2021-01-222021-10-042021-05-182021-11-102021-0...,77697.0
4,대구,1,id47id50id52id54id56id59,393.6,471.0,goldgoldgoldgoldvipsilver,ESTJENFPISFJENFJESTJESFJ,404.779978,2021-05-282021-12-052021-05-202021-06-212021-0...,49536.0
5,대구,2,id42id55id58,140.0,211.0,goldgoldsilver,ESTPENTPESTP,79.667919,2021-02-092021-02-062021-04-18,13969.0
6,부산,0,id24id25id27id30id31id32id33id37id39,481.0,573.0,goldgoldsilvergoldgoldvipsilversilvergold,INFJESTPESTPESTJESFJISFJENFJESTPINFJ,395.272907,2021-09-112021-07-122021-10-132021-05-282021-0...,61289.0
7,부산,1,id21id22id23id26id28id34id36id38,430.7,514.0,goldgoldgoldgoldgoldsilvergoldgold,ISFPENFPISTPENFPENTPINFPINTPESTP,460.657406,2021-05-032021-02-092021-05-212021-05-012021-1...,46922.0
8,부산,2,id29id35,16.5,124.0,goldsilver,ENTPESTJ,101.195372,2021-08-282021-06-10,9877.0
9,서울,0,id01id06id11id12id13id16id19,220.0,467.0,goldvipgoldgoldgoldgoldgold,ENFJINTPENFPESTPESFJESFPISFP,484.809540,2021-07-162021-09-122021-10-292021-11-302021-1...,56891.0
10,서울,1,id02id03id07id08id10id14id15id17id20,389.3,621.0,goldgoldsilversilvergoldgoldgoldgoldgold,ENFJISTJISFJINFJISFPENTJENTPISTPINTJ,506.371383,2021-05-122021-03-162021-01-112021-03-062021-0...,55666.0
11,서울,2,id04id05id09id18,143.3,292.0,vipvipgoldgold,INFPISFJESFJISFJ,179.328213,2021-07-212021-03-072021-03-212021-03-03,12528.0

In [117]:
df = df.sort_values('views',ascending=False)
print(df.iloc[2, 0])

대구

# 문제9

In [136]:
df = pd.read_csv('members.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          100 non-null    object
 1   age         100 non-null    float64
 2   city        100 non-null    object
 3   f1          69 non-null     float64
 4   f2          100 non-null    int64
 5   f3          72 non-null     object
 6   f4          100 non-null    object
 7   f5          100 non-null    float64
 8   subscribed  100 non-null    object
 9   views       96 non-null     float64
dtypes: float64(4), int64(1), object(5)
memory usage: 7.9+ KB

In [137]:
df['subscribed'] = pd.to_datetime(df['subscribed'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          100 non-null    object
 1   age         100 non-null    float64
 2   city        100 non-null    object
 3   f1          69 non-null     float64
 4   f2          100 non-null    int64
 5   f3          72 non-null     object
 6   f4          100 non-null    object
 7   f5          100 non-null    float64
 8   subscribed  100 non-null    datetime64[ns]
 9   views       96 non-null     float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(4)
memory usage: 7.9+ KB

In [138]:
df['year'] = df['subscribed'].dt.year
df['month'] = df['subscribed'].dt.month
df['day'] = df['subscribed'].dt.day

df.head()

,id,age,city,f1,f2,f3,f4,f5,subscribed,views,year,month,day
0,id01,2.0,서울,NaN,0,gold,ENFJ,91.297791,2021-07-16,6820.0,2021,7,16
1,id02,9.0,서울,70.0,1,NaN,ENFJ,60.339826,2021-05-12,2534.0,2021,5,12
2,id03,27.0,서울,61.0,1,gold,ISTJ,17.252986,2021-03-16,7312.0,2021,3,16
3,id04,75.0,서울,NaN,2,NaN,INFP,52.667078,2021-07-21,493.0,2021,7,21
4,id05,24.0,서울,85.0,2,NaN,ISFJ,29.269869,2021-03-07,1338.0,2021,3,7

In [139]:
df = df.groupby('month').count()
df

       id  age  city  f1  f2  f3  f4  f5  subscribed  views  year  day
month
1       8    8     8   7   8   4   8   8           8      8     8    8
2       9    9     9   7   9   7   9   9           9      9     9    9
3       8    8     8   6   8   5   8   8           8      7     8    8
4       6    6     6   3   6   4   6   6           6      6     6    6
5      15   15    15  12  15  13  15  15          15     15    15   15
6       8    8     8   4   8   5   8   8           8      8     8    8
7      10   10    10   6  10   7  10  10          10      9    10   10
8       8    8     8   2   8   7   8   8           8      8     8    8
9       7    7     7   7   7   6   7   7           7      7     7    7
10      9    9     9   7   9   7   9   9           9      8     9    9
11      5    5     5   2   5   2   5   5           5      5     5    5
12      7    7     7   6   7   5   7   7           7      6     7    7

In [140]:
df.sort_values('subscribed').index[0]

np.int32(11)

# 모의고사 작업형1